# ====================================
# Brewfile - Personal Development Setup
# ====================================
# Managed by dotfiles repository
# Corporate apps: See Brewfile.work
# Mac App Store apps: See Brewfile.mas

# ====================================
# Taps
# ====================================
tap "anomalyco/tap"
tap "antoniorodr/memo"
tap "dbt-labs/dbt-cli"
tap "steipete/tap"
tap "supabase/tap"
tap "yakitrak/yakitrak"

# ====================================
# Essentials
# ====================================
brew "git"
brew "zsh"
brew "powerlevel10k"
brew "wget"
brew "gh"                 # GitHub CLI
brew "speedtest-cli"
brew "tmux"
brew "neovim"

# ====================================
# Development Tools
# ====================================

# Languages & Runtimes
brew "python@3.11"
brew "python@3.12"
brew "go"
brew "fnm"                # Fast Node Manager
brew "nvm"                # Node Version Manager

# Package Managers & Build Tools
brew "cocoapods"
brew "uv"                 # Fast Python package installer

# Database & Data
brew "dbt-labs/dbt-cli/dbt"

# Infrastructure & DevOps
brew "docker"
brew "colima"             # Docker runtime
brew "flyctl"             # Fly.io CLI
brew "railway"            # Railway CLI
brew "supabase/tap/supabase"

# ====================================
# Productivity & Utilities
# ====================================
brew "watchman"           # File watching
brew "nmap"               # Network scanner
brew "ffmpeg"             # Media processing
brew "imagemagick"        # Image processing
brew "actionlint"         # GitHub Actions linter
brew "marksman"           # Markdown LSP
brew "mist-cli"           # macOS installer
brew "ykman"              # YubiKey manager

# ====================================
# Specialized Tools
# ====================================
brew "anomalyco/tap/opencode"
brew "antoniorodr/memo/memo"
brew "steipete/tap/gifgrep"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/ordercli"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "yakitrak/yakitrak/obsidian-cli"

# ====================================
# GUI Applications - Essentials
# ====================================
cask "1password"
cask "1password-cli"
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "slack"

# ====================================
# GUI Applications - Browsers
# ====================================
cask "arc"
cask "brave-browser"
cask "zen"

# ====================================
# GUI Applications - Development
# ====================================
cask "cursor"
cask "visual-studio-code@insiders"
cask "github-copilot-for-xcode"
cask "figma"
cask "expo-orbit"
cask "gcloud-cli"
cask "powershell"

# ====================================
# GUI Applications - Terminals
# ====================================
cask "ghostty"
cask "kitty"
cask "wezterm"

# ====================================
# GUI Applications - AI Tools
# ====================================
cask "chatgpt"
cask "claude"
cask "openclaw"
cask "opencode-desktop"

# ====================================
# GUI Applications - Communication
# ====================================
cask "discord"
cask "messenger"
cask "telegram"
cask "whatsapp"

# ====================================
# GUI Applications - Productivity
# ====================================
cask "obsidian"
cask "macwhisper"
cask "sf-symbols"
cask "appcleaner"
cask "antigravity"
cask "comet"

# ====================================
# GUI Applications - Utilities
# ====================================
cask "balenaetcher"
cask "nordvpn"
cask "teamviewer"
cask "vlc"
cask "mactracker"
cask "opencore-patcher"

# ====================================
# Fonts
# ====================================
cask "font-monaspace"
cask "font-monaspice-nerd-font"

# ====================================
# VSCode Extensions
# ====================================
vscode "akamud.vscode-theme-onedark"
vscode "chrisdias.promptboost"
vscode "dbcode.dbcode"
vscode "dbtlabsinc.dbt"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "expo.vscode-expo-tools"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msjsdiag.vscode-react-native"
vscode "oracle.sql-developer"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "vs-publisher-473885.github-copilot-ultimate-extension-pack"
